Handschriften/handschriften.org
#+TITLE: Erstellung von MARC21 für die Handschriften der UBG
#+OPTIONS: ^:nil


* Vorbemerkungen
  Dieses Projekt wird in dieser Datei (=handschriften.org=) verwaltet. Alles
  außer den Ausgangsdaten wird aus dieser Datei mithilfe von =org-babel= und den
  literate programming-Funktionalitäten von Emacs bzw. =org-mode= exportiert. D.
  h. dass die resultierende Datei =handschriften_sosa.py= wahrscheinlich nicht
  sehr gut leserlich und sicher nicht PEP8-konform ist. Ich bitte dafür um
  Entschuldigung.

*** Dateien in diesem Ordner
    #+BEGIN_EXAMPLE
      .
      ├── output
      │   ├── errors.txt                        [nicht verarbeitete Zeilen]
      │   └── handschriften.xml                 [das resultierende MARCXML]
      ├── sourcefiles
      │   ├── 0-600.csv                         [Ausgangsdaten]
      │   ├── 1201-1800.csv                     [Ausgangsdaten]
      │   ├── 1801-Ende.csv                     [Ausgangsdaten]
      │   ├── 601-1200.csv                      [Ausgangsdaten]
      │   ├── Namensansetzung_Kern_Alma.csv     [Ansetzungsformen und GND-IDs Personen]
      │   └── vb_kor.csv                        [Ansetzungsformen und GND-IDs Körperschaften]
      ├── handschriften.html                    [HTML-Export dieser Datei]
      ├── handschriften.org                     [diese Datei]
      └── handschriften_sosa.py                 [das aus dieser Datei exportierte Python-Script]
    #+END_EXAMPLE

           
* Ausgangsdaten
  Die Daten sind in dieser Excel-Datei zu finden:

  [[file:MS-ALMA_Stand_final.xlsx]]

  Um es für die BearbeiterInnen übersichtlich zu halten, wurden eigene Sheets
  für jeweils 600 Signaturen angelegt. Jedes dieser Sheets wird als CSV
  gespeichert (einfach mit "speichern unter") um die Verarbeitung zu
  vereinfachen. Der Aufwand, xlsx mit Python einzulesen zahlt sich nicht aus.


* Jahrhundertangaben
  [[file:Addendum%20zu%20r%C3%B6mische%20Jahrhundert%20Angaben.docx]]

  Addendum zu römische Jahrhundert Angaben:

  Das Jahrhundert beginnt immer mit dem Jahr xxx1
	XII = 1101 – 1200
	XIII = 1201 – 1300
  für 008: XV = 1401

  Hälften:
  1.Hälfte 	XII/1 = 1101 – 1150
  XIII/1 = 1201 – 1150
  2.Hälfte	XII/2 = 1151 – 1200
  XIII/2 = 1251-1300
  für 008: XIII/2 = 1251

  Anfang: ersten zwei Dekaden
	Anfang XII = 1101 – 1120
	Anfang XIII = 1201 – 1220
  für 008: Anfang XII = 1101

  Ende: letzten zwei Dekaden
	Ende XII = 1181 – 1200
	Ende XII = 1281 – 1300
	Für 008: Ende XII = 1281

  Mitte: zwei Dekanden
	Mitte XII = 1141 – 1160
	Mitte XIII = 1141 - 1260
  Für 008: Mitte XII = 1151

  vor: minus eine Dekade
	vor 1254	1244 – 1254

  nach: plus eine Dekade
	nach 1254	1254 – 1256

  ca. plus fünf Jahre, minus fünf Jahre
	ca. 1254	1249 - 1259

  um wie ca.
* Verarbeitung
*** Imports, globals
    #+NAME: imports
    #+BEGIN_SRC python
      import csv
      from pymarc_helpers import *
      from pymarc import Record, Field
      import datetime
      import re
      from sys import argv

      part1 = "sourcefiles/0-600.csv"
      part2 = "sourcefiles/601-1200.csv"
      part3 = "sourcefiles/1201-1800.csv"
      part4 = "sourcefiles/1801-Ende.csv"

      # output nur schreiben wenn write_out als kommandozeilenargument gegeben wird
      write_output = False
      if len(argv) > 1:
          if argv[1] == "write_out":
              write_output = True
    #+END_SRC

    Zur Erklärung:

    =part1=, =part2= etc. sind die Dateinamen der einzelnen Input-Files. Jede
    dieser Dateien entspricht einem Sheet in der ursprünglichen Excel-Datei. Ich
    habe sie deshalb nicht zu einem CSV zusammengesetzt, weil hier und da
    Datenkorrekturen an einzelnen Sheets gemacht wurden und ich nicht immer alle
    neu als CSV-abspeichern wollte.

    Die Prüfung auf =write_output= dient dazu, zu steuern, ob das Script eben
    das MARC-File schreibt oder nicht. Beim interaktiven herumspielen brauche
    ich das nicht jedes mal.

*** Das CSV importieren
    Importiere das CSV und gebe eine Liste mit einem orderedDict pro Reihe aus.

    #+NAME: csv_to_list
    #+BEGIN_SRC python
      def csv_to_list(filename):
          """Read a csv file and return a list of dicts (one per line)"""

          rows = []
          with open(filename, newline='') as csvfile:
              reader = csv.DictReader(csvfile, delimiter="\t")
              for row in reader:
                  if "*" in row["Signatur modern"]:
                      continue
                  else:
                      rows.append(row)

          return rows

    #+END_SRC
*** Funktion: create_record()
    Die Hauptarbeit findet in der Funktion =create_record()= statt. Diese nimmt
    eine Zeile aus dem CSV (orderedDict) engegen und gibt ein
    pymarc.Record-Objekt zurück.

