Handschriften/handschriften.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-09-17 Di 17:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Erstellung von MARC21 für die Handschriften der UBG</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Stefan Schuh" />
</head>
<body>
<div id="content">
<h1 class="title">Erstellung von MARC21 für die Handschriften der UBG</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org384dc43">1. Vorbemerkungen</a>
<ul>
<li><a href="#org556861b">1.1. Dateien in diesem Ordner</a></li>
</ul>
</li>
<li><a href="#org8b90472">2. Ausgangsdaten</a></li>
<li><a href="#org170a30c">3. Jahrhundertangaben</a></li>
<li><a href="#orgf9e471b">4. Verarbeitung</a>
<ul>
<li><a href="#org4a9f07e">4.1. Imports, globals</a></li>
<li><a href="#orgafddef0">4.2. Das CSV importieren</a></li>
<li><a href="#org3a97434">4.3. Funktion: create_record()</a>
<ul>
<li><a href="#orge489425">4.3.1. <span class="done DONE">DONE</span> 245</a></li>
<li><a href="#org66867c3">4.3.2. <span class="done DONE">DONE</span> UBG als besitzende Institution eintragen</a></li>
<li><a href="#orgc7a928a">4.3.3. <span class="done DONE">DONE</span> Leader</a></li>
<li><a href="#org1dcfff6">4.3.4. <span class="done DONE">DONE</span> Beschreibstoff</a></li>
<li><a href="#org8c516c3">4.3.5. <span class="done DONE">DONE</span> 008</a></li>
<li><a href="#org989b2bc">4.3.6. <span class="done DONE">DONE</span> 500 mit Stand</a></li>
<li><a href="#org35c4fa6">4.3.7. <span class="done DONE">DONE</span> Fußnote mit alter Signatur</a></li>
<li><a href="#orgcda7bca">4.3.8. <span class="done DONE">DONE</span> Vorbesitzer eintragen</a></li>
<li><a href="#org741e0c5">4.3.9. <span class="done DONE">DONE</span> 300</a></li>
<li><a href="#org3431e09">4.3.10. <span class="done DONE">DONE</span> Jahreszahl</a></li>
<li><a href="#orgedf2968">4.3.11. <span class="done DONE">DONE</span> Bestand</a></li>
<li><a href="#orgcd41cf8">4.3.12. Die ganze Funktion</a></li>
</ul>
</li>
<li><a href="#orga5c7a72">4.4. Zusammensetzen aller Teile</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org384dc43" class="outline-2">
<h2 id="org384dc43"><span class="section-number-2">1</span> Vorbemerkungen</h2>
<div class="outline-text-2" id="text-1">
<p>
Dieses Projekt wird in dieser Datei (<code>handschriften.org</code>) verwaltet. Alles
außer den Ausgangsdaten wird aus dieser Datei mithilfe von <code>org-babel</code> und den
literate programming-Funktionalitäten von Emacs bzw. <code>org-mode</code> exportiert. D.
h. dass die resultierende Datei <code>handschriften_sosa.py</code> wahrscheinlich nicht
sehr gut leserlich und sicher nicht PEP8-konform ist. Ich bitte dafür um
Entschuldigung.
</p>
</div>

<div id="outline-container-org556861b" class="outline-3">
<h3 id="org556861b"><span class="section-number-3">1.1</span> Dateien in diesem Ordner</h3>
<div class="outline-text-3" id="text-1-1">
<pre class="example">
.
├── output
│   ├── errors.txt                        [nicht verarbeitete Zeilen]
│   └── handschriften.xml                 [das resultierende MARCXML]
├── sourcefiles
│   ├── 0-600.csv                         [Ausgangsdaten]
│   ├── 1201-1800.csv                     [Ausgangsdaten]
│   ├── 1801-Ende.csv                     [Ausgangsdaten]
│   ├── 601-1200.csv                      [Ausgangsdaten]
│   ├── Namensansetzung_Kern_Alma.csv     [Ansetzungsformen und GND-IDs Personen]
│   └── vb_kor.csv                        [Ansetzungsformen und GND-IDs Körperschaften]
├── handschriften.html                    [HTML-Export dieser Datei]
├── handschriften.org                     [diese Datei]
└── handschriften_sosa.py                 [das aus dieser Datei exportierte Python-Script]
</pre>
</div>
</div>
</div>


<div id="outline-container-org8b90472" class="outline-2">
<h2 id="org8b90472"><span class="section-number-2">2</span> Ausgangsdaten</h2>
<div class="outline-text-2" id="text-2">
<p>
Die Daten sind in dieser Excel-Datei zu finden:
</p>

<p>
<a href="MS-ALMA_Stand_final.xlsx">MS-ALMA_Stand_final.xlsx</a>
</p>

<p>
Um es für die BearbeiterInnen übersichtlich zu halten, wurden eigene Sheets
für jeweils 600 Signaturen angelegt. Jedes dieser Sheets wird als CSV
gespeichert (einfach mit "speichern unter") um die Verarbeitung zu
vereinfachen. Der Aufwand, xlsx mit Python einzulesen zahlt sich nicht aus.
</p>
</div>
</div>


<div id="outline-container-org170a30c" class="outline-2">
<h2 id="org170a30c"><span class="section-number-2">3</span> Jahrhundertangaben</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="Addendum zu römische Jahrhundert Angaben.docx">Addendum zu römische Jahrhundert Angaben.docx</a>
</p>

<p>
Addendum zu römische Jahrhundert Angaben:
</p>

<p>
Das Jahrhundert beginnt immer mit dem Jahr xxx1
XII = 1101 – 1200
XIII = 1201 – 1300
für 008: XV = 1401
</p>

<p>
Hälften:
1.Hälfte 	XII/1 = 1101 – 1150
XIII/1 = 1201 – 1150
2.Hälfte	XII/2 = 1151 – 1200
XIII/2 = 1251-1300
für 008: XIII/2 = 1251
</p>

<p>
Anfang: ersten zwei Dekaden
Anfang XII = 1101 – 1120
Anfang XIII = 1201 – 1220
für 008: Anfang XII = 1101
</p>

<p>
Ende: letzten zwei Dekaden
Ende XII = 1181 – 1200
Ende XII = 1281 – 1300
Für 008: Ende XII = 1281
</p>

<p>
Mitte: zwei Dekanden
Mitte XII = 1141 – 1160
Mitte XIII = 1141 - 1260
Für 008: Mitte XII = 1151
</p>

<p>
vor: minus eine Dekade
vor 1254	1244 – 1254
</p>

<p>
nach: plus eine Dekade
nach 1254	1254 – 1256
</p>

<p>
ca. plus fünf Jahre, minus fünf Jahre
ca. 1254	1249 - 1259
</p>

<p>
um wie ca.
</p>
</div>
</div>
<div id="outline-container-orgf9e471b" class="outline-2">
<h2 id="orgf9e471b"><span class="section-number-2">4</span> Verarbeitung</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org4a9f07e" class="outline-3">
<h3 id="org4a9f07e"><span class="section-number-3">4.1</span> Imports, globals</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-python" id="orgc371223"><span style="color: #4c83ff;">import</span> csv
<span style="color: #4c83ff;">from</span> pymarc_helpers <span style="color: #4c83ff;">import</span> *
<span style="color: #4c83ff;">from</span> pymarc <span style="color: #4c83ff;">import</span> Record, Field
<span style="color: #4c83ff;">import</span> datetime
<span style="color: #4c83ff;">import</span> re
<span style="color: #4c83ff;">from</span> sys <span style="color: #4c83ff;">import</span> argv

<span style="color: #ff69b4;">part1</span> = <span style="color: #61CE3C;">"sourcefiles/0-600.csv"</span>
<span style="color: #ff69b4;">part2</span> = <span style="color: #61CE3C;">"sourcefiles/601-1200.csv"</span>
<span style="color: #ff69b4;">part3</span> = <span style="color: #61CE3C;">"sourcefiles/1201-1800.csv"</span>
<span style="color: #ff69b4;">part4</span> = <span style="color: #61CE3C;">"sourcefiles/1801-Ende.csv"</span>

<span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">output nur schreiben wenn write_out als kommandozeilenargument gegeben wird</span>
<span style="color: #ff69b4;">write_output</span> = <span style="color: #96CBFE;">False</span>
<span style="color: #4c83ff;">if</span> <span style="color: #4c83ff;">len</span><span style="color: #8b0000;">(</span>argv<span style="color: #8b0000;">)</span> &gt; <span style="color: #96CBFE;">1</span>:
    <span style="color: #4c83ff;">if</span> argv<span style="color: #8b0000;">[</span><span style="color: #96CBFE;">1</span><span style="color: #8b0000;">]</span> == <span style="color: #61CE3C;">"write_out"</span>:
        <span style="color: #ff69b4;">write_output</span> = <span style="color: #96CBFE;">True</span>
</pre>
</div>

<p>
Zur Erklärung:
</p>

<p>
<code>part1</code>, <code>part2</code> etc. sind die Dateinamen der einzelnen Input-Files. Jede
dieser Dateien entspricht einem Sheet in der ursprünglichen Excel-Datei. Ich
habe sie deshalb nicht zu einem CSV zusammengesetzt, weil hier und da
Datenkorrekturen an einzelnen Sheets gemacht wurden und ich nicht immer alle
neu als CSV-abspeichern wollte.
</p>

<p>
Die Prüfung auf <code>write_output</code> dient dazu, zu steuern, ob das Script eben
das MARC-File schreibt oder nicht. Beim interaktiven herumspielen brauche
ich das nicht jedes mal.
</p>
</div>
</div>

<div id="outline-container-orgafddef0" class="outline-3">
<h3 id="orgafddef0"><span class="section-number-3">4.2</span> Das CSV importieren</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Importiere das CSV und gebe eine Liste mit einem orderedDict pro Reihe aus.
</p>

<div class="org-src-container">
<pre class="src src-python" id="orgf6da8e6"><span style="color: #4c83ff;">def</span> <span style="color: #ff1493;">csv_to_list</span><span style="color: #8b0000;">(</span>filename<span style="color: #8b0000;">)</span>:
    <span style="color: #FBDE2D;">"""Read a csv file and return a list of dicts (one per line)"""</span>

    <span style="color: #ff69b4;">rows</span> = <span style="color: #8b0000;">[]</span>
    <span style="color: #4c83ff;">with</span> <span style="color: #4c83ff;">open</span><span style="color: #8b0000;">(</span>filename, newline=<span style="color: #61CE3C;">''</span><span style="color: #8b0000;">)</span> <span style="color: #4c83ff;">as</span> csvfile:
        <span style="color: #ff69b4;">reader</span> = csv.DictReader<span style="color: #8b0000;">(</span>csvfile, delimiter=<span style="color: #61CE3C;">"\t"</span><span style="color: #8b0000;">)</span>
        <span style="color: #4c83ff;">for</span> row <span style="color: #4c83ff;">in</span> reader:
            <span style="color: #4c83ff;">if</span> <span style="color: #61CE3C;">"*"</span> <span style="color: #4c83ff;">in</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Signatur modern"</span><span style="color: #8b0000;">]</span>:
                <span style="color: #4c83ff;">continue</span>
            <span style="color: #4c83ff;">else</span>:
                rows.append<span style="color: #8b0000;">(</span>row<span style="color: #8b0000;">)</span>

    <span style="color: #4c83ff;">return</span> rows

</pre>
</div>
</div>
</div>
<div id="outline-container-org3a97434" class="outline-3">
<h3 id="org3a97434"><span class="section-number-3">4.3</span> Funktion: create_record()</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Die Hauptarbeit findet in der Funktion <code>create_record()</code> statt. Diese nimmt
eine Zeile aus dem CSV (orderedDict) engegen und gibt ein
pymarc.Record-Objekt zurück.
</p>
</div>
