Handschriften/handschriften.org
***** DONE 245
      CLOSED: [2018-08-08 Mit 13:01]
      UBG Ms {signatur modern}

      Wenn "Bd." nicht "":
      UBG Ms {signatur modern}/{Bd.}

      #+NAME: create 245
      #+BEGIN_SRC python
        # generiere Inhalt für 245
        if not row['Signatur modern']:
            return "Keine Signatur vorhanden"
        else:
            if row["Bd."]:
                val245 = f"UBG Ms {row['Signatur modern'].strip()}/{row['Bd.'].strip()}"
            else:
                val245 = f"UBG Ms {row['Signatur modern'].strip()}"

            rec.add_ordered_field(
                Field(
                    tag = '245',
                    indicators = ['0', '0'],
                    subfields = ['a', val245]))

      #+END_SRC
***** DONE UBG als besitzende Institution eintragen
      CLOSED: [2018-10-15 Mon 09:26]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-10-15 Mon 09:26]
      :END:
      - own :: gegenwärtige EingentümerIn
      #+NAME: own
      #+BEGIN_SRC python
        rec.add_field(
            Field(
                tag = "710",
                indicators = ["2", " "],
                subfields = ["a", "Universitätsbibliothek Graz", "0", "(DE-588)18018-X", "4", "own"]
            ))
      #+END_SRC 
***** DONE Leader
      CLOSED: [2018-11-29 Do 16:19]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-29 Do 16:19]
      :END:
      - LDR/06=t für handschriftliches Sprachmaterial. Wenn Noten vorliegen,
        muss das dann ausgebessert werden.
      - Katalogisierungslevel LDR/17=5 für Teillevel (vorläufig) - muss dann beim
        Katalogisieren ausgebessert werden.
      #+NAME: leader
      #+BEGIN_SRC python
      rec.leader = "00000ntm#a22000005c#4500"
      #+END_SRC
******* DONE Prüfen, ob Alma beim Import Datensatzlänge etc. einträgt.
        CLOSED: [2018-11-29 Do 16:19]
        :LOGBOOK:
        - State "DONE"       from "TODO"       [2018-11-29 Do 16:19] \\
          Tut es nicht, sollte aber egal sein.
        :END:
***** DONE Beschreibstoff
      CLOSED: [2018-11-29 Do 17:05]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-29 Do 17:05]
      :END:
      Für Books gibt es in 007 keinen Code für physical medium, daher wird der
      Text unverändert übernommen. Umso besser, dann muss nichts geprüft werden.
      #+NAME: beschreibstoff
      #+BEGIN_SRC python
        beschreibstoff = row["Beschreibstoff"].strip()
        rec.add_ordered_field(
            Field(
                tag = "340",
                indicators = [" ", " "],
                subfields = ["a", beschreibstoff])
        )
      #+END_SRC
***** DONE 008
      CLOSED: [2018-11-29 Do 16:48]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-29 Do 16:48]
      :END:
      171013|2014####gw############|||#|#ger#u
      - [X] 00-05: Date entered on file
      - [X] 06: s
      - [X] 07-10: date_008()
      - [X] 11-14: "    "
      - [X] 15-17: Code für unbekannt
      - [X] 18-21: "||||"
      - [X] 22: "|"
      - [X] 23: " "
      - [X] 24-27: "||||"
      - [X] 28: " "
      - [X] 29: "0"
      - [X] 30: "0"
      - [X] 31: "|"
      - [X] 32: "|"
      - [X] 33: "|"
      - [X] 34: "|"
      - [X] 35-37: "   "
      - [X] 38: "|"
      - [X] 39: "|"
      #+NAME: create 008
      #+BEGIN_SRC python
                date_on_file = datetime.datetime.now().strftime("%y%m%d")
                data008 = date_on_file + "s" + year + "    " + "xx " + "||||"  "|" + " " + "||||" + " 00||||   ||"
                rec.add_ordered_field(
                    Field(tag = "008",
                          data = data008)
                )
      #+END_SRC
***** DONE 500 mit Stand
      CLOSED: [2018-11-29 Do 08:21]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-29 Do 08:21]
      :END:
      #+NAME: stand in 500
      #+BEGIN_SRC python
        rec.add_ordered_field(
            Field(
                tag = "500",
                indicators = [" ", " "],
                subfields = ["a", "Stand 2018"])
        )
      #+END_SRC
***** DONE Fußnote mit alter Signatur
      - [X] In 500 mit Präfix "Historische Signatur der Universitätsbibliothek Graz: XXXXX"

        #+NAME: alte signatur in 500
        #+BEGIN_SRC python
          if row["Signatur alt"]:
              rec.add_field(
                  Field(
                      tag = '500',
                      indicators = [' ', ' '],
                      subfields = ['a', f'Historische Signatur der Universitätsbibliothek Graz: {row["Signatur alt"].strip()}'])
              )
        #+END_SRC
***** DONE Vorbesitzer eintragen
      CLOSED: [2018-11-30 Fr 16:23]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-30 Fr 16:23]
      :END:
      - fmo :: frühere EingentümerIn
