Handschriften/handschriften.html

<div id="outline-container-orge489425" class="outline-4">
<h4 id="orge489425"><span class="section-number-4">4.3.1</span> <span class="done DONE">DONE</span> 245</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
UBG Ms {signatur modern}
</p>

<p>
Wenn "Bd." nicht "":
UBG Ms {signatur modern}/{Bd.}
</p>

<div class="org-src-container">
<pre class="src src-python" id="org288d8cc"><span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">generiere Inhalt f&#252;r 245</span>
<span style="color: #4c83ff;">if</span> <span style="color: #4c83ff;">not</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'Signatur modern'</span><span style="color: #8b0000;">]</span>:
    <span style="color: #4c83ff;">return</span> <span style="color: #61CE3C;">"Keine Signatur vorhanden"</span>
<span style="color: #4c83ff;">else</span>:
    <span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Bd."</span><span style="color: #8b0000;">]</span>:
        <span style="color: #ff69b4;">val245</span> = f<span style="color: #61CE3C;">"UBG Ms {row['Signatur modern'].strip()}/{row['Bd.'].strip()}"</span>
    <span style="color: #4c83ff;">else</span>:
        <span style="color: #ff69b4;">val245</span> = f<span style="color: #61CE3C;">"UBG Ms {row['Signatur modern'].strip()}"</span>

    rec.add_ordered_field<span style="color: #8b0000;">(</span>
        Field<span style="color: #006400;">(</span>
            tag = <span style="color: #61CE3C;">'245'</span>,
            indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">'0'</span>, <span style="color: #61CE3C;">'0'</span><span style="color: #ff1493;">]</span>,
            subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">'a'</span>, val245<span style="color: #ff1493;">]</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org66867c3" class="outline-4">
<h4 id="org66867c3"><span class="section-number-4">4.3.2</span> <span class="done DONE">DONE</span> UBG als besitzende Institution eintragen</h4>
<div class="outline-text-4" id="text-4-3-2">
<dl class="org-dl">
<dt>own</dt><dd>gegenwärtige EingentümerIn</dd>
</dl>
<div class="org-src-container">
<pre class="src src-python" id="org3ac5c22">rec.add_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">"710"</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"2"</span>, <span style="color: #61CE3C;">" "</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"a"</span>, <span style="color: #61CE3C;">"Universita&#776;tsbibliothek Graz"</span>, <span style="color: #61CE3C;">"0"</span>, <span style="color: #61CE3C;">"(DE-588)18018-X"</span>, <span style="color: #61CE3C;">"4"</span>, <span style="color: #61CE3C;">"own"</span><span style="color: #ff1493;">]</span>
    <span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc7a928a" class="outline-4">
<h4 id="orgc7a928a"><span class="section-number-4">4.3.3</span> <span class="done DONE">DONE</span> Leader</h4>
<div class="outline-text-4" id="text-4-3-3">
<ul class="org-ul">
<li>LDR/06=t für handschriftliches Sprachmaterial. Wenn Noten vorliegen,
muss das dann ausgebessert werden.</li>
<li>Katalogisierungslevel LDR/17=5 für Teillevel (vorläufig) - muss dann beim
Katalogisieren ausgebessert werden.</li>
</ul>
<div class="org-src-container">
<pre class="src src-python" id="org168dcd0"><span style="color: #ff69b4;">rec.leader</span> = <span style="color: #61CE3C;">"00000ntm#a22000005c#4500"</span>
</pre>
</div>
</div>
<ol class="org-ol">
<li><a id="orga546747"></a><span class="done DONE">DONE</span> Prüfen, ob Alma beim Import Datensatzlänge etc. einträgt.<br />
<div class="outline-text-5" id="text-4-3-3-1">
</div>
</li>
</ol>
</div>
<div id="outline-container-org1dcfff6" class="outline-4">
<h4 id="org1dcfff6"><span class="section-number-4">4.3.4</span> <span class="done DONE">DONE</span> Beschreibstoff</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
Für Books gibt es in 007 keinen Code für physical medium, daher wird der
Text unverändert übernommen. Umso besser, dann muss nichts geprüft werden.
</p>
<div class="org-src-container">
<pre class="src src-python" id="orga24d412"><span style="color: #ff69b4;">beschreibstoff</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Beschreibstoff"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
rec.add_ordered_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">"340"</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">" "</span>, <span style="color: #61CE3C;">" "</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"a"</span>, beschreibstoff<span style="color: #ff1493;">]</span><span style="color: #006400;">)</span>
<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8c516c3" class="outline-4">
<h4 id="org8c516c3"><span class="section-number-4">4.3.5</span> <span class="done DONE">DONE</span> 008</h4>
<div class="outline-text-4" id="text-4-3-5">
<p>
171013|2014####gw############|||#|#ger#u
</p>
<ul class="org-ul">
<li class="on"><code>[X]</code> 00-05: Date entered on file</li>
<li class="on"><code>[X]</code> 06: s</li>
<li class="on"><code>[X]</code> 07-10: date_008()</li>
<li class="on"><code>[X]</code> 11-14: "    "</li>
<li class="on"><code>[X]</code> 15-17: Code für unbekannt</li>
<li class="on"><code>[X]</code> 18-21: "||||"</li>
<li class="on"><code>[X]</code> 22: "|"</li>
<li class="on"><code>[X]</code> 23: " "</li>
<li class="on"><code>[X]</code> 24-27: "||||"</li>
<li class="on"><code>[X]</code> 28: " "</li>
<li class="on"><code>[X]</code> 29: "0"</li>
<li class="on"><code>[X]</code> 30: "0"</li>
<li class="on"><code>[X]</code> 31: "|"</li>
<li class="on"><code>[X]</code> 32: "|"</li>
<li class="on"><code>[X]</code> 33: "|"</li>
<li class="on"><code>[X]</code> 34: "|"</li>
<li class="on"><code>[X]</code> 35-37: "   "</li>
<li class="on"><code>[X]</code> 38: "|"</li>
<li class="on"><code>[X]</code> 39: "|"</li>
</ul>
<div class="org-src-container">
<pre class="src src-python" id="orga25eb2a"><span style="color: #ff69b4;">date_on_file</span> = datetime.datetime.now<span style="color: #8b0000;">()</span>.strftime<span style="color: #8b0000;">(</span><span style="color: #61CE3C;">"%y%m%d"</span><span style="color: #8b0000;">)</span>
<span style="color: #ff69b4;">data008</span> = date_on_file + <span style="color: #61CE3C;">"s"</span> + year + <span style="color: #61CE3C;">"    "</span> + <span style="color: #61CE3C;">"xx "</span> + <span style="color: #61CE3C;">"||||"</span>  <span style="color: #61CE3C;">"|"</span> + <span style="color: #61CE3C;">" "</span> + <span style="color: #61CE3C;">"||||"</span> + <span style="color: #61CE3C;">" 00||||   ||"</span>
rec.add_ordered_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>tag = <span style="color: #61CE3C;">"008"</span>,
          data = data008<span style="color: #006400;">)</span>
<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org989b2bc" class="outline-4">
<h4 id="org989b2bc"><span class="section-number-4">4.3.6</span> <span class="done DONE">DONE</span> 500 mit Stand</h4>
<div class="outline-text-4" id="text-4-3-6">
<div class="org-src-container">
<pre class="src src-python" id="orgc2334c1">rec.add_ordered_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">"500"</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">" "</span>, <span style="color: #61CE3C;">" "</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"a"</span>, <span style="color: #61CE3C;">"Stand 2018"</span><span style="color: #ff1493;">]</span><span style="color: #006400;">)</span>
<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org35c4fa6" class="outline-4">
<h4 id="org35c4fa6"><span class="section-number-4">4.3.7</span> <span class="done DONE">DONE</span> Fußnote mit alter Signatur</h4>
<div class="outline-text-4" id="text-4-3-7">
<ul class="org-ul">
<li class="on"><code>[X]</code> <p>
In 500 mit Präfix "Historische Signatur der Universitätsbibliothek Graz: XXXXX"
</p>

<div class="org-src-container">
<pre class="src src-python" id="org86ad917"><span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Signatur alt"</span><span style="color: #8b0000;">]</span>:
    rec.add_field<span style="color: #8b0000;">(</span>
        Field<span style="color: #006400;">(</span>
            tag = <span style="color: #61CE3C;">'500'</span>,
            indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">' '</span>, <span style="color: #61CE3C;">' '</span><span style="color: #ff1493;">]</span>,
            subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">'a'</span>, f<span style="color: #61CE3C;">'Historische Signatur der Universit&#228;tsbibliothek Graz: {row["Signatur alt"].strip()}'</span><span style="color: #ff1493;">]</span><span style="color: #006400;">)</span>
    <span style="color: #8b0000;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgcda7bca" class="outline-4">
<h4 id="orgcda7bca"><span class="section-number-4">4.3.8</span> <span class="done DONE">DONE</span> Vorbesitzer eintragen</h4>
<div class="outline-text-4" id="text-4-3-8">
<dl class="org-dl">
<dt>fmo</dt><dd>frühere EingentümerIn</dd>
</dl>
</div>
<ol class="org-ol">
