Handschriften/handschriften.org
******* DONE Körperschaften
        CLOSED: [2018-11-30 Fr 16:23]
        :LOGBOOK:
        - State "DONE"       from "TODO"       [2018-11-30 Fr 16:23]
        :END:
        #+NAME: kor dict
        #+BEGIN_SRC python
          vb_kor = {}
          with open("sourcefiles/vb_kor.csv") as csvfile:
              reader = csv.reader(csvfile, delimiter='\t')
              for row in reader:
                  vb_kor[row[0].strip()] = ['a', row[1].strip(), '0', row[2].strip()]
        #+END_SRC

        #+NAME: vorbesitzende koerperschaften
        #+BEGIN_SRC python
          vorbes_kor = []
          if row["1. Vorbesitz Institution"] != '':
              vorbes_kor.append(row["1. Vorbesitz Institution"].strip())
          if row["2. Vorbesitz Institution"] != '':
              vorbes_kor.append(row["2. Vorbesitz Institution"].strip())

          if len(vorbes_kor) > 0:
              for kor in vorbes_kor:
                  if kor not in vb_kor:
                      korfield = Field(
                          tag = '710',
                          indicators = ['2', ' '],
                          subfields = ['a', kor, '4', 'fmo'])
                      rec.add_ordered_field(korfield)
                      print(korfield)
                  else:
                      korfield = Field(
                          tag = '710',
                          indicators = ['2', ' '],
                          subfields = vb_kor[kor] + ['4', 'fmo'])
                      rec.add_ordered_field(korfield)
        #+END_SRC
******* DONE Personen
        CLOSED: [2018-11-29 Do 16:09]
        :LOGBOOK:
        - State "DONE"       from "TODO"       [2018-11-29 Do 16:09]
        :END:
********* DONE Dictionary bauen
          CLOSED: [2018-11-29 Do 16:09]
          :LOGBOOK:
          - State "DONE"       from "TODO"       [2018-11-29 Do 16:09]
          :END:
          Zuerst wird das dict gebaut (im globalen Namespace)
          #+NAME: name dict
          #+BEGIN_SRC python
            vb_pers = {}
            with open("sourcefiles/Namensansetzung_Kern_Alma.csv") as csvfile:
                reader = csv.reader(csvfile, delimiter='\t')
                for row in reader:
                    vb_pers[row[0].strip()] = ['a', row[1].strip(), 'c', row[2].strip(), '0', row[3].strip()]
          #+END_SRC
********* DONE Personen in ein Feld schreiben
          CLOSED: [2018-11-29 Do 16:08]
          :LOGBOOK:
          - State "DONE"       from "TODO"       [2018-11-29 Do 16:08]
          :END:
          #+NAME: vorbesitzende personen
          #+BEGIN_SRC python
            vorbes_nat_pers = []
            if row["1. VB natürl. Personen"] != '':
                vorbes_nat_pers.append(row["1. VB natürl. Personen"].strip())
            if row["2. VB natürl. Personen"] != '':
                vorbes_nat_pers.append(row["2. VB natürl. Personen"].strip())

            if len(vorbes_nat_pers) > 0:
                for pers in vorbes_nat_pers:
                    if pers not in vb_pers:
                        print(f"Person nicht vorhanden: {pers}")
                        continue
                    else:
                        persfield = Field(
                            tag = '700',
                            indicators = ['1', ' '],
                            subfields = vb_pers[pers] + ['4', 'fmo'])
                        if "," not in vb_pers[pers][1]:
                            persfield.indicators = ['0', ' ']
                        rec.add_ordered_field(persfield)
          #+END_SRC
