Handschriften/handschriften.html
<li><a id="org83c710b"></a><span class="done DONE">DONE</span> Körperschaften<br />
<div class="outline-text-5" id="text-4-3-8-1">
<div class="org-src-container">
<pre class="src src-python" id="orga959bcf"><span style="color: #ff69b4;">vb_kor</span> = <span style="color: #8b0000;">{}</span>
<span style="color: #4c83ff;">with</span> <span style="color: #4c83ff;">open</span><span style="color: #8b0000;">(</span><span style="color: #61CE3C;">"sourcefiles/vb_kor.csv"</span><span style="color: #8b0000;">)</span> <span style="color: #4c83ff;">as</span> csvfile:
    <span style="color: #ff69b4;">reader</span> = csv.reader<span style="color: #8b0000;">(</span>csvfile, delimiter=<span style="color: #61CE3C;">'\t'</span><span style="color: #8b0000;">)</span>
    <span style="color: #4c83ff;">for</span> row <span style="color: #4c83ff;">in</span> reader:
        vb_kor<span style="color: #8b0000;">[</span>row<span style="color: #006400;">[</span><span style="color: #96CBFE;">0</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">]</span> = <span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'a'</span>, row<span style="color: #006400;">[</span><span style="color: #96CBFE;">1</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span>, <span style="color: #61CE3C;">'0'</span>, row<span style="color: #006400;">[</span><span style="color: #96CBFE;">2</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python" id="orga378b95"><span style="color: #ff69b4;">vorbes_kor</span> = <span style="color: #8b0000;">[]</span>
<span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Vorbesitz Institution"</span><span style="color: #8b0000;">]</span> != <span style="color: #61CE3C;">''</span>:
    vorbes_kor.append<span style="color: #8b0000;">(</span>row<span style="color: #006400;">[</span><span style="color: #61CE3C;">"1. Vorbesitz Institution"</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">)</span>
<span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"2. Vorbesitz Institution"</span><span style="color: #8b0000;">]</span> != <span style="color: #61CE3C;">''</span>:
    vorbes_kor.append<span style="color: #8b0000;">(</span>row<span style="color: #006400;">[</span><span style="color: #61CE3C;">"2. Vorbesitz Institution"</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">)</span>

<span style="color: #4c83ff;">if</span> <span style="color: #4c83ff;">len</span><span style="color: #8b0000;">(</span>vorbes_kor<span style="color: #8b0000;">)</span> &gt; <span style="color: #96CBFE;">0</span>:
    <span style="color: #4c83ff;">for</span> kor <span style="color: #4c83ff;">in</span> vorbes_kor:
        <span style="color: #4c83ff;">if</span> kor <span style="color: #4c83ff;">not</span> <span style="color: #4c83ff;">in</span> vb_kor:
            <span style="color: #ff69b4;">korfield</span> = Field<span style="color: #8b0000;">(</span>
                tag = <span style="color: #61CE3C;">'710'</span>,
                indicators = <span style="color: #006400;">[</span><span style="color: #61CE3C;">'2'</span>, <span style="color: #61CE3C;">' '</span><span style="color: #006400;">]</span>,
                subfields = <span style="color: #006400;">[</span><span style="color: #61CE3C;">'a'</span>, kor, <span style="color: #61CE3C;">'4'</span>, <span style="color: #61CE3C;">'fmo'</span><span style="color: #006400;">]</span><span style="color: #8b0000;">)</span>
            rec.add_ordered_field<span style="color: #8b0000;">(</span>korfield<span style="color: #8b0000;">)</span>
            <span style="color: #4c83ff;">print</span><span style="color: #8b0000;">(</span>korfield<span style="color: #8b0000;">)</span>
        <span style="color: #4c83ff;">else</span>:
            <span style="color: #ff69b4;">korfield</span> = Field<span style="color: #8b0000;">(</span>
                tag = <span style="color: #61CE3C;">'710'</span>,
                indicators = <span style="color: #006400;">[</span><span style="color: #61CE3C;">'2'</span>, <span style="color: #61CE3C;">' '</span><span style="color: #006400;">]</span>,
                subfields = vb_kor<span style="color: #006400;">[</span>kor<span style="color: #006400;">]</span> + <span style="color: #006400;">[</span><span style="color: #61CE3C;">'4'</span>, <span style="color: #61CE3C;">'fmo'</span><span style="color: #006400;">]</span><span style="color: #8b0000;">)</span>
            rec.add_ordered_field<span style="color: #8b0000;">(</span>korfield<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</li>
<li><a id="org84bab9a"></a><span class="done DONE">DONE</span> Personen<br />
<div class="outline-text-5" id="text-4-3-8-2">
</div>
<ol class="org-ol">
<li><a id="orgd806c76"></a><span class="done DONE">DONE</span> Dictionary bauen<br />
<div class="outline-text-6" id="text-4-3-8-2-1">
<p>
Zuerst wird das dict gebaut (im globalen Namespace)
</p>
<div class="org-src-container">
<pre class="src src-python" id="org2a0bb4e"><span style="color: #ff69b4;">vb_pers</span> = <span style="color: #8b0000;">{}</span>
<span style="color: #4c83ff;">with</span> <span style="color: #4c83ff;">open</span><span style="color: #8b0000;">(</span><span style="color: #61CE3C;">"sourcefiles/Namensansetzung_Kern_Alma.csv"</span><span style="color: #8b0000;">)</span> <span style="color: #4c83ff;">as</span> csvfile:
    <span style="color: #ff69b4;">reader</span> = csv.reader<span style="color: #8b0000;">(</span>csvfile, delimiter=<span style="color: #61CE3C;">'\t'</span><span style="color: #8b0000;">)</span>
    <span style="color: #4c83ff;">for</span> row <span style="color: #4c83ff;">in</span> reader:
        vb_pers<span style="color: #8b0000;">[</span>row<span style="color: #006400;">[</span><span style="color: #96CBFE;">0</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">]</span> = <span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'a'</span>, row<span style="color: #006400;">[</span><span style="color: #96CBFE;">1</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span>, <span style="color: #61CE3C;">'c'</span>, row<span style="color: #006400;">[</span><span style="color: #96CBFE;">2</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span>, <span style="color: #61CE3C;">'0'</span>, row<span style="color: #006400;">[</span><span style="color: #96CBFE;">3</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">]</span>
</pre>
</div>
</div>
</li>
<li><a id="orgec7b9f3"></a><span class="done DONE">DONE</span> Personen in ein Feld schreiben<br />
<div class="outline-text-6" id="text-4-3-8-2-2">
<div class="org-src-container">
<pre class="src src-python" id="org12d73ef"><span style="color: #ff69b4;">vorbes_nat_pers</span> = <span style="color: #8b0000;">[]</span>
<span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. VB nat&#252;rl. Personen"</span><span style="color: #8b0000;">]</span> != <span style="color: #61CE3C;">''</span>:
    vorbes_nat_pers.append<span style="color: #8b0000;">(</span>row<span style="color: #006400;">[</span><span style="color: #61CE3C;">"1. VB nat&#252;rl. Personen"</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">)</span>
<span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"2. VB nat&#252;rl. Personen"</span><span style="color: #8b0000;">]</span> != <span style="color: #61CE3C;">''</span>:
    vorbes_nat_pers.append<span style="color: #8b0000;">(</span>row<span style="color: #006400;">[</span><span style="color: #61CE3C;">"2. VB nat&#252;rl. Personen"</span><span style="color: #006400;">]</span>.strip<span style="color: #006400;">()</span><span style="color: #8b0000;">)</span>

<span style="color: #4c83ff;">if</span> <span style="color: #4c83ff;">len</span><span style="color: #8b0000;">(</span>vorbes_nat_pers<span style="color: #8b0000;">)</span> &gt; <span style="color: #96CBFE;">0</span>:
    <span style="color: #4c83ff;">for</span> pers <span style="color: #4c83ff;">in</span> vorbes_nat_pers:
        <span style="color: #4c83ff;">if</span> pers <span style="color: #4c83ff;">not</span> <span style="color: #4c83ff;">in</span> vb_pers:
            <span style="color: #4c83ff;">print</span><span style="color: #8b0000;">(</span>f<span style="color: #61CE3C;">"Person nicht vorhanden: {pers}"</span><span style="color: #8b0000;">)</span>
            <span style="color: #4c83ff;">continue</span>
        <span style="color: #4c83ff;">else</span>:
            <span style="color: #ff69b4;">persfield</span> = Field<span style="color: #8b0000;">(</span>
                tag = <span style="color: #61CE3C;">'700'</span>,
                indicators = <span style="color: #006400;">[</span><span style="color: #61CE3C;">'1'</span>, <span style="color: #61CE3C;">' '</span><span style="color: #006400;">]</span>,
                subfields = vb_pers<span style="color: #006400;">[</span>pers<span style="color: #006400;">]</span> + <span style="color: #006400;">[</span><span style="color: #61CE3C;">'4'</span>, <span style="color: #61CE3C;">'fmo'</span><span style="color: #006400;">]</span><span style="color: #8b0000;">)</span>
            <span style="color: #4c83ff;">if</span> <span style="color: #61CE3C;">","</span> <span style="color: #4c83ff;">not</span> <span style="color: #4c83ff;">in</span> vb_pers<span style="color: #8b0000;">[</span>pers<span style="color: #8b0000;">][</span><span style="color: #96CBFE;">1</span><span style="color: #8b0000;">]</span>:
                <span style="color: #ff69b4;">persfield.indicators</span> = <span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'0'</span>, <span style="color: #61CE3C;">' '</span><span style="color: #8b0000;">]</span>
            rec.add_ordered_field<span style="color: #8b0000;">(</span>persfield<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</li>
</ol>
</li>
</ol>
</div>
