Handschriften/handschriften.org
***** DONE 300
      CLOSED: [2018-11-29 Do 17:14]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-11-29 Do 17:14]
      - State "TODO"       from "DONE"       [2018-11-29 Do 17:09]
      :END:
      - [X] sf a: =f"{Umfang} Blätter"=
      - [X] sf c: =f"{row["Format"].strip()}, {row["Größe h : b "].strip().replace(":", "x")}"=
      
      #+NAME: create 300
      #+BEGIN_SRC python
        # Umfangsangabe in 300
        if "rolle" in row["Umfang"].lower():
            sfa = row["Umfang"].strip()
        else:
            sfa = f'{row["Umfang"].strip()} Blätter'

        sfc = f'{row["Format"].strip()}, {row["Größe h : b   "].strip().replace(":", "x")}'

        if sfa.startswith(" "):
            sfa = ""
        if sfc.startswith(", "):
            sfc = sfc[2:]
        if sfc.endswith(", "):
            sfc = sfc[:-2]
        rec.add_ordered_field(
            Field(
                tag = '300',
                indicators = [' ', ' '],
                subfields = ["a", sfa, "c", sfc]))
      #+END_SRC
***** DONE Jahreszahl
      CLOSED: [2018-10-19 Fre 09:38]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-10-19 Fre 09:38]
      :END:
      Das Erstellen der Jahreszahl ist nicht trivial, weil es sehr heterogene
      Angaben etc. gibt. Zuerst müssen wir einmal zu einem Datum kommen. Das
      machen wir mit der Funktion =get_date()=:

      
      #+NAME: get date
      #+BEGIN_SRC python
        def get_date(row):
            """Return the raw date for 264 $$c and 008"""
            data = None

            if row["1. Dat. exakt"].strip():
                data = row["1. Dat. exakt"].strip()
            elif row["1. Dat. Ex. Von - bis"].strip():
                data = row["1. Dat. Ex. Von - bis"].strip()
            elif row['1. Dat. ca., um, vor, Anfang, Ende'].strip():
                data = row['1. Dat. ca., um, vor, Anfang, Ende'].strip()
            elif row["1. Dat. Jh. "].strip():
                data = row["1. Dat. Jh. "].strip()
            else:
                data = "Datum unbekannt"

            return data
      #+END_SRC

******* Für 264
        Für 264 können wir nehmen, was da ist, wenn etwas da ist:
        #+NAME: date 264
        #+BEGIN_SRC python
          rec.add_ordered_field(
              pymarc.Field(
                  tag = "264",
                  indicators = [" ", "1"],
                  subfields = ["c", f"[{get_date(row)}]"]))
        #+END_SRC
        
        
