Handschriften/handschriften.html
<div id="outline-container-org741e0c5" class="outline-4">
<h4 id="org741e0c5"><span class="section-number-4">4.3.9</span> <span class="done DONE">DONE</span> 300</h4>
<div class="outline-text-4" id="text-4-3-9">
<ul class="org-ul">
<li class="on"><code>[X]</code> sf a: <code>f"{Umfang} Blätter"</code></li>
<li class="on"><code>[X]</code> sf c: <code>f"{row["Format"].strip()}, {row["Größe h : b "].strip().replace(":", "x")}"</code></li>
</ul>

<div class="org-src-container">
<pre class="src src-python" id="org91ef4f1"><span style="color: #8B8989; font-style: italic;"># </span><span style="color: #8B8989; font-style: italic;">Umfangsangabe in 300</span>
<span style="color: #4c83ff;">if</span> <span style="color: #61CE3C;">"rolle"</span> <span style="color: #4c83ff;">in</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Umfang"</span><span style="color: #8b0000;">]</span>.lower<span style="color: #8b0000;">()</span>:
    <span style="color: #ff69b4;">sfa</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Umfang"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
<span style="color: #4c83ff;">else</span>:
    <span style="color: #ff69b4;">sfa</span> = f<span style="color: #61CE3C;">'{row["Umfang"].strip()} Bl&#228;tter'</span>

<span style="color: #ff69b4;">sfc</span> = f<span style="color: #61CE3C;">'{row["Format"].strip()}, {row["Gr&#246;&#223;e h : b   "].strip().replace(":", "x")}'</span>

<span style="color: #4c83ff;">if</span> sfa.startswith<span style="color: #8b0000;">(</span><span style="color: #61CE3C;">" "</span><span style="color: #8b0000;">)</span>:
    <span style="color: #ff69b4;">sfa</span> = <span style="color: #61CE3C;">""</span>
<span style="color: #4c83ff;">if</span> sfc.startswith<span style="color: #8b0000;">(</span><span style="color: #61CE3C;">", "</span><span style="color: #8b0000;">)</span>:
    <span style="color: #ff69b4;">sfc</span> = sfc<span style="color: #8b0000;">[</span><span style="color: #96CBFE;">2</span>:<span style="color: #8b0000;">]</span>
<span style="color: #4c83ff;">if</span> sfc.endswith<span style="color: #8b0000;">(</span><span style="color: #61CE3C;">", "</span><span style="color: #8b0000;">)</span>:
    <span style="color: #ff69b4;">sfc</span> = sfc<span style="color: #8b0000;">[</span>:-<span style="color: #96CBFE;">2</span><span style="color: #8b0000;">]</span>
rec.add_ordered_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">'300'</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">' '</span>, <span style="color: #61CE3C;">' '</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"a"</span>, sfa, <span style="color: #61CE3C;">"c"</span>, sfc<span style="color: #ff1493;">]</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org3431e09" class="outline-4">
<h4 id="org3431e09"><span class="section-number-4">4.3.10</span> <span class="done DONE">DONE</span> Jahreszahl</h4>
<div class="outline-text-4" id="text-4-3-10">
<p>
Das Erstellen der Jahreszahl ist nicht trivial, weil es sehr heterogene
Angaben etc. gibt. Zuerst müssen wir einmal zu einem Datum kommen. Das
machen wir mit der Funktion <code>get_date()</code>:
</p>


<div class="org-src-container">
<pre class="src src-python" id="org631f23a"><span style="color: #4c83ff;">def</span> <span style="color: #ff1493;">get_date</span><span style="color: #8b0000;">(</span>row<span style="color: #8b0000;">)</span>:
    <span style="color: #FBDE2D;">"""Return the raw date for 264 $$c and 008"""</span>
    <span style="color: #ff69b4;">data</span> = <span style="color: #96CBFE;">None</span>

    <span style="color: #4c83ff;">if</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. exakt"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>:
        <span style="color: #ff69b4;">data</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. exakt"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
    <span style="color: #4c83ff;">elif</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. Ex. Von - bis"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>:
        <span style="color: #ff69b4;">data</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. Ex. Von - bis"</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
    <span style="color: #4c83ff;">elif</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'1. Dat. ca., um, vor, Anfang, Ende'</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>:
        <span style="color: #ff69b4;">data</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">'1. Dat. ca., um, vor, Anfang, Ende'</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
    <span style="color: #4c83ff;">elif</span> row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. Jh. "</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>:
        <span style="color: #ff69b4;">data</span> = row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"1. Dat. Jh. "</span><span style="color: #8b0000;">]</span>.strip<span style="color: #8b0000;">()</span>
    <span style="color: #4c83ff;">else</span>:
        <span style="color: #ff69b4;">data</span> = <span style="color: #61CE3C;">"Datum unbekannt"</span>

    <span style="color: #4c83ff;">return</span> data
</pre>
</div>
</div>

<ol class="org-ol">
<li><a id="org926e468"></a>Für 264<br />
<div class="outline-text-5" id="text-4-3-10-1">
<p>
Für 264 können wir nehmen, was da ist, wenn etwas da ist:
</p>
<div class="org-src-container">
<pre class="src src-python" id="orga98442f">rec.add_ordered_field<span style="color: #8b0000;">(</span>
    pymarc.Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">"264"</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">" "</span>, <span style="color: #61CE3C;">"1"</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"c"</span>, f<span style="color: #61CE3C;">"[{get_date(row)}]"</span><span style="color: #ff1493;">]</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</li>
