Handschriften/handschriften.org
******* Für 008
        In 008 müssen wir das Datum, das wir haben, in einen vierstellige Zahl
        umwandeln.

        Sollten wir nicht schon ein passendes Datum haben, brauchen wir ein
        Mapping für Jahrhundertangaben etc.:

        #+NAME: mapping datierung
        #+BEGIN_SRC python
          map_dates_008 = {
              "VI": "501",
              "IX/1": "801",
              "Mitte IX": "851",
              "Ende IX": "881",
              "Anfang X": "901",
              "Mitte X": "951",
              "Ende X": "981",
              "X": "901",
              "X/1": "901",
              "X/2": "951",
              "Anfang XI": "1001",
              "Mitte XI": "1051",
              "Ende XI": "1081",
              "XI": "1051",
              "XI/1": "1001",
              "XI/2": "1051",
              "Anfang XII": "1101",
              "Mitte XII": "1151",
              "Ende XII": "1181",
              "XII": "1151",
              "XII/1": "1101",
              "XII/2": "1151",
              "Anfang XIII": "1201",
              "Mitte XIII": "1251",
              "Ende XIII": "1281",
              "XIII": "1251",
              "XIII/1": "1201",
              "XIII/2": "1251",
              "Anfang XIV": "1301",
              "Mitte XIV": "1351",
              "Ende XIV": "1381",
              "Spätes XIV": "1381",
              "XIV": "1351",
              "XIV/1": "1301",
              "XIV/2": "1351",
              "Anfang XV": "1401",
              "Erstes Viertel XV": "1401",
              "Mitte XV": "1451",
              "Nach Mitte XV": "1451",
              "Ende XV": "1481",
              "XV": "1451",
              "XV/1": "1401",
              "XV/2": "1451",
              "Anfang XVI": "1501",
              "Mitte XVI": "1551",
              "Ende XVI": "1581",
              "XVI": "1551",
              "XVI/1": "1501",
              "XVI/2": "1551",
              "Anfang XVII": "1601",
              "Mitte XVII": "1651",
              "Ende XVII": "1681",
              "XVII": "1651",
              "XVII/1": "1601",
              "XVII/2": "1651",
              "Anfang XVIII": "1701",
              "Vor Mitte XVIII": "1701",
              "Mitte XVIII": "1751",
              "Ende XVIII": "1781",
              "XVIII": "1751",
              "XVIII/1": "1701",
              "XVIII/2": "1751",
              "Mitte XIX": "1851",
              "XIX": "1801",
              "XIX/1": "1801",
              "XIX/2": "1851",
          }
        #+END_SRC

        Dann erarbeiten wir uns das Datum mittels der Funktion =date_008()=:
        #+NAME: date 008
        #+BEGIN_SRC python
          def date_008(date):
              year = None
              if date in map_dates_008.keys():
                  year = map_dates_008[date].zfill(4)
              else:
                  re_match = re.search(r'\d{3}\d?', date)
                  if re_match is not None:
                      year = re_match.group(0).strip().zfill(4)
              return year
        #+END_SRC
***** DONE Bestand
      CLOSED: [2018-10-19 Fre 09:52]
      :LOGBOOK:
      - State "DONE"       from "TODO"       [2018-10-19 Fre 09:52]
      :END:
      - [X] Standort
      - [X] Signatur
        - [X] Präfix: "Ms "
      - [X] Historische Signatur in alt call nr
      - [X] =$$9LOCAL=, damit das Feld, mit dem der Bestand erstellt wird, nicht
        in die Verbunddatenbank eingespielt wird

      #+NAME: bestand
      #+BEGIN_SRC python
        standort = "SSHS"
        signatur = "Ms " + row["Signatur modern"]

        rec.add_field(
            Field(
                tag = "995",
                indicators = [" ", " "],
                subfields = ["b", "BHB", 
                             "c", standort,
                             "h", signatur,
                             "a", row["Signatur alt"],
                             "9", "LOCAL"
                             ]
            ))

      #+END_SRC
        
