Handschriften/handschriften.html


<li><a id="orgf3c1270"></a>Für 008<br />
<div class="outline-text-5" id="text-4-3-10-2">
<p>
In 008 müssen wir das Datum, das wir haben, in einen vierstellige Zahl
umwandeln.
</p>

<p>
Sollten wir nicht schon ein passendes Datum haben, brauchen wir ein
Mapping für Jahrhundertangaben etc.:
</p>

<div class="org-src-container">
<pre class="src src-python" id="orga70b8ad"><span style="color: #ff69b4;">map_dates_008</span> = <span style="color: #8b0000;">{</span>
    <span style="color: #61CE3C;">"VI"</span>: <span style="color: #61CE3C;">"501"</span>,
    <span style="color: #61CE3C;">"IX/1"</span>: <span style="color: #61CE3C;">"801"</span>,
    <span style="color: #61CE3C;">"Mitte IX"</span>: <span style="color: #61CE3C;">"851"</span>,
    <span style="color: #61CE3C;">"Ende IX"</span>: <span style="color: #61CE3C;">"881"</span>,
    <span style="color: #61CE3C;">"Anfang X"</span>: <span style="color: #61CE3C;">"901"</span>,
    <span style="color: #61CE3C;">"Mitte X"</span>: <span style="color: #61CE3C;">"951"</span>,
    <span style="color: #61CE3C;">"Ende X"</span>: <span style="color: #61CE3C;">"981"</span>,
    <span style="color: #61CE3C;">"X"</span>: <span style="color: #61CE3C;">"901"</span>,
    <span style="color: #61CE3C;">"X/1"</span>: <span style="color: #61CE3C;">"901"</span>,
    <span style="color: #61CE3C;">"X/2"</span>: <span style="color: #61CE3C;">"951"</span>,
    <span style="color: #61CE3C;">"Anfang XI"</span>: <span style="color: #61CE3C;">"1001"</span>,
    <span style="color: #61CE3C;">"Mitte XI"</span>: <span style="color: #61CE3C;">"1051"</span>,
    <span style="color: #61CE3C;">"Ende XI"</span>: <span style="color: #61CE3C;">"1081"</span>,
    <span style="color: #61CE3C;">"XI"</span>: <span style="color: #61CE3C;">"1051"</span>,
    <span style="color: #61CE3C;">"XI/1"</span>: <span style="color: #61CE3C;">"1001"</span>,
    <span style="color: #61CE3C;">"XI/2"</span>: <span style="color: #61CE3C;">"1051"</span>,
    <span style="color: #61CE3C;">"Anfang XII"</span>: <span style="color: #61CE3C;">"1101"</span>,
    <span style="color: #61CE3C;">"Mitte XII"</span>: <span style="color: #61CE3C;">"1151"</span>,
    <span style="color: #61CE3C;">"Ende XII"</span>: <span style="color: #61CE3C;">"1181"</span>,
    <span style="color: #61CE3C;">"XII"</span>: <span style="color: #61CE3C;">"1151"</span>,
    <span style="color: #61CE3C;">"XII/1"</span>: <span style="color: #61CE3C;">"1101"</span>,
    <span style="color: #61CE3C;">"XII/2"</span>: <span style="color: #61CE3C;">"1151"</span>,
    <span style="color: #61CE3C;">"Anfang XIII"</span>: <span style="color: #61CE3C;">"1201"</span>,
    <span style="color: #61CE3C;">"Mitte XIII"</span>: <span style="color: #61CE3C;">"1251"</span>,
    <span style="color: #61CE3C;">"Ende XIII"</span>: <span style="color: #61CE3C;">"1281"</span>,
    <span style="color: #61CE3C;">"XIII"</span>: <span style="color: #61CE3C;">"1251"</span>,
    <span style="color: #61CE3C;">"XIII/1"</span>: <span style="color: #61CE3C;">"1201"</span>,
    <span style="color: #61CE3C;">"XIII/2"</span>: <span style="color: #61CE3C;">"1251"</span>,
    <span style="color: #61CE3C;">"Anfang XIV"</span>: <span style="color: #61CE3C;">"1301"</span>,
    <span style="color: #61CE3C;">"Mitte XIV"</span>: <span style="color: #61CE3C;">"1351"</span>,
    <span style="color: #61CE3C;">"Ende XIV"</span>: <span style="color: #61CE3C;">"1381"</span>,
    <span style="color: #61CE3C;">"Sp&#228;tes XIV"</span>: <span style="color: #61CE3C;">"1381"</span>,
    <span style="color: #61CE3C;">"XIV"</span>: <span style="color: #61CE3C;">"1351"</span>,
    <span style="color: #61CE3C;">"XIV/1"</span>: <span style="color: #61CE3C;">"1301"</span>,
    <span style="color: #61CE3C;">"XIV/2"</span>: <span style="color: #61CE3C;">"1351"</span>,
    <span style="color: #61CE3C;">"Anfang XV"</span>: <span style="color: #61CE3C;">"1401"</span>,
    <span style="color: #61CE3C;">"Erstes Viertel XV"</span>: <span style="color: #61CE3C;">"1401"</span>,
    <span style="color: #61CE3C;">"Mitte XV"</span>: <span style="color: #61CE3C;">"1451"</span>,
    <span style="color: #61CE3C;">"Nach Mitte XV"</span>: <span style="color: #61CE3C;">"1451"</span>,
    <span style="color: #61CE3C;">"Ende XV"</span>: <span style="color: #61CE3C;">"1481"</span>,
    <span style="color: #61CE3C;">"XV"</span>: <span style="color: #61CE3C;">"1451"</span>,
    <span style="color: #61CE3C;">"XV/1"</span>: <span style="color: #61CE3C;">"1401"</span>,
    <span style="color: #61CE3C;">"XV/2"</span>: <span style="color: #61CE3C;">"1451"</span>,
    <span style="color: #61CE3C;">"Anfang XVI"</span>: <span style="color: #61CE3C;">"1501"</span>,
    <span style="color: #61CE3C;">"Mitte XVI"</span>: <span style="color: #61CE3C;">"1551"</span>,
    <span style="color: #61CE3C;">"Ende XVI"</span>: <span style="color: #61CE3C;">"1581"</span>,
    <span style="color: #61CE3C;">"XVI"</span>: <span style="color: #61CE3C;">"1551"</span>,
    <span style="color: #61CE3C;">"XVI/1"</span>: <span style="color: #61CE3C;">"1501"</span>,
    <span style="color: #61CE3C;">"XVI/2"</span>: <span style="color: #61CE3C;">"1551"</span>,
    <span style="color: #61CE3C;">"Anfang XVII"</span>: <span style="color: #61CE3C;">"1601"</span>,
    <span style="color: #61CE3C;">"Mitte XVII"</span>: <span style="color: #61CE3C;">"1651"</span>,
    <span style="color: #61CE3C;">"Ende XVII"</span>: <span style="color: #61CE3C;">"1681"</span>,
    <span style="color: #61CE3C;">"XVII"</span>: <span style="color: #61CE3C;">"1651"</span>,
    <span style="color: #61CE3C;">"XVII/1"</span>: <span style="color: #61CE3C;">"1601"</span>,
    <span style="color: #61CE3C;">"XVII/2"</span>: <span style="color: #61CE3C;">"1651"</span>,
    <span style="color: #61CE3C;">"Anfang XVIII"</span>: <span style="color: #61CE3C;">"1701"</span>,
    <span style="color: #61CE3C;">"Vor Mitte XVIII"</span>: <span style="color: #61CE3C;">"1701"</span>,
    <span style="color: #61CE3C;">"Mitte XVIII"</span>: <span style="color: #61CE3C;">"1751"</span>,
    <span style="color: #61CE3C;">"Ende XVIII"</span>: <span style="color: #61CE3C;">"1781"</span>,
    <span style="color: #61CE3C;">"XVIII"</span>: <span style="color: #61CE3C;">"1751"</span>,
    <span style="color: #61CE3C;">"XVIII/1"</span>: <span style="color: #61CE3C;">"1701"</span>,
    <span style="color: #61CE3C;">"XVIII/2"</span>: <span style="color: #61CE3C;">"1751"</span>,
    <span style="color: #61CE3C;">"Mitte XIX"</span>: <span style="color: #61CE3C;">"1851"</span>,
    <span style="color: #61CE3C;">"XIX"</span>: <span style="color: #61CE3C;">"1801"</span>,
    <span style="color: #61CE3C;">"XIX/1"</span>: <span style="color: #61CE3C;">"1801"</span>,
    <span style="color: #61CE3C;">"XIX/2"</span>: <span style="color: #61CE3C;">"1851"</span>,
<span style="color: #8b0000;">}</span>
</pre>
</div>

<p>
Dann erarbeiten wir uns das Datum mittels der Funktion <code>date_008()</code>:
</p>
<div class="org-src-container">
<pre class="src src-python" id="org65de53c"><span style="color: #4c83ff;">def</span> <span style="color: #ff1493;">date_008</span><span style="color: #8b0000;">(</span>date<span style="color: #8b0000;">)</span>:
    <span style="color: #ff69b4;">year</span> = <span style="color: #96CBFE;">None</span>
    <span style="color: #4c83ff;">if</span> date <span style="color: #4c83ff;">in</span> map_dates_008.keys<span style="color: #8b0000;">()</span>:
        <span style="color: #ff69b4;">year</span> = map_dates_008<span style="color: #8b0000;">[</span>date<span style="color: #8b0000;">]</span>.zfill<span style="color: #8b0000;">(</span><span style="color: #96CBFE;">4</span><span style="color: #8b0000;">)</span>
    <span style="color: #4c83ff;">else</span>:
        <span style="color: #ff69b4;">re_match</span> = re.search<span style="color: #8b0000;">(</span>r<span style="color: #61CE3C;">'\d{3}\d?'</span>, date<span style="color: #8b0000;">)</span>
        <span style="color: #4c83ff;">if</span> re_match <span style="color: #4c83ff;">is</span> <span style="color: #4c83ff;">not</span> <span style="color: #96CBFE;">None</span>:
            <span style="color: #ff69b4;">year</span> = re_match.group<span style="color: #8b0000;">(</span><span style="color: #96CBFE;">0</span><span style="color: #8b0000;">)</span>.strip<span style="color: #8b0000;">()</span>.zfill<span style="color: #8b0000;">(</span><span style="color: #96CBFE;">4</span><span style="color: #8b0000;">)</span>
    <span style="color: #4c83ff;">return</span> year
</pre>
</div>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgedf2968" class="outline-4">
<h4 id="orgedf2968"><span class="section-number-4">4.3.11</span> <span class="done DONE">DONE</span> Bestand</h4>
<div class="outline-text-4" id="text-4-3-11">
<ul class="org-ul">
<li class="on"><code>[X]</code> Standort</li>
<li class="on"><code>[X]</code> Signatur
<ul class="org-ul">
<li class="on"><code>[X]</code> Präfix: "Ms "</li>
</ul></li>
<li class="on"><code>[X]</code> Historische Signatur in alt call nr</li>
<li class="on"><code>[X]</code> <code>$$9LOCAL</code>, damit das Feld, mit dem der Bestand erstellt wird, nicht
in die Verbunddatenbank eingespielt wird</li>
</ul>

<div class="org-src-container">
<pre class="src src-python" id="org3961bac"><span style="color: #ff69b4;">standort</span> = <span style="color: #61CE3C;">"SSHS"</span>
<span style="color: #ff69b4;">signatur</span> = <span style="color: #61CE3C;">"Ms "</span> + row<span style="color: #8b0000;">[</span><span style="color: #61CE3C;">"Signatur modern"</span><span style="color: #8b0000;">]</span>

rec.add_field<span style="color: #8b0000;">(</span>
    Field<span style="color: #006400;">(</span>
        tag = <span style="color: #61CE3C;">"995"</span>,
        indicators = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">" "</span>, <span style="color: #61CE3C;">" "</span><span style="color: #ff1493;">]</span>,
        subfields = <span style="color: #ff1493;">[</span><span style="color: #61CE3C;">"b"</span>, <span style="color: #61CE3C;">"BHB"</span>, 
                     <span style="color: #61CE3C;">"c"</span>, standort,
                     <span style="color: #61CE3C;">"h"</span>, signatur,
                     <span style="color: #61CE3C;">"a"</span>, row<span style="color: #ffff00;">[</span><span style="color: #61CE3C;">"Signatur alt"</span><span style="color: #ffff00;">]</span>,
                     <span style="color: #61CE3C;">"9"</span>, <span style="color: #61CE3C;">"LOCAL"</span>
                     <span style="color: #ff1493;">]</span>
    <span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

</pre>
</div>
</div>
</div>
